package Selenium;

public class UserRepo {

	public static User getInvalidUser1() {
		return new User("1111", "1111", "1111", "$%#@", "11", "11111", "Ukraine", "Некоректне введення, лише літери",
				"Некоректне введення, лише літери", "Введіть коректну адресу",
				"Логін повинен складатись лише з латинських літер і/або цифр, від 6 до 20 символів",
				"Пароль повинен складатись з латинських літер і/або цифр, від 6 до 20 символів",
				"Підтвердження паролю неправильне");
	}
	public static User getInvalidUser2() {
		return new User("//@#", "^$&*", "aaaa", "admin", "aa", "nnnnnnnn", "Ukraine", "Некоректне введення, лише літери",
				"Некоректне введення, лише літери", "Введіть коректну адресу", "Цей логін уже використовується",
				"Пароль повинен складатись з латинських літер і/або цифр, від 6 до 20 символів",
				"Підтвердження паролю неправильне" );
	}
}
